import { MigrationInterface, QueryRunner } from 'typeorm';

export class SoilTypeData1731772118902 implements MigrationInterface {
    public async up(queryRunner: QueryRunner): Promise<void> {
        await queryRunner.query(`
        INSERT INTO "soil_type" ("code", "name", "description")
        VALUES 
            ('CHZ', 'Чорнозем', 'Родючий ґрунт, багатий органічними речовинами, характерний для степів і лісостепів.'),
            ('PZ', 'Підзолисті ґрунти', 'Бідні на поживні речовини ґрунти, що утворюються в лісових зонах, часто з яскраво вираженою підзолистою горизонтом.'),
            ('SRZ', 'Сіроземи', 'Ґрунти з світлим кольором, зустрічаються в сухих та напівсухих кліматах, часто мають вапняний характер.'),
            ('LSG', 'Лісові ґрунти', 'Ґрунти, що утворюються в лісах, багаті на органічні речовини, темного кольору.'),
            ('GRK', 'Гірські ґрунти', 'Ґрунти, характерні для гірських місцевостей, часто важкі, з високим вмістом каменів.'),
            ('TFG', 'Торфові ґрунти', 'Ґрунти, що утворюються в болотистих місцевостях, багаті органічними речовинами, але часто бідні на поживні елементи.'),
            ('SLN', 'Солонці', 'Ґрунти з високим вмістом солей, що утворюються в умовах посушливого клімату.'),
            ('LG', 'Лугові ґрунти', 'Родючі ґрунти, що утворюються в лугових зонах, багаті на поживні речовини та органічні елементи.');
    `);
    }

    public async down(queryRunner: QueryRunner): Promise<void> {
        await queryRunner.query('DELETE FROM soil_type');
    }
}
