import { MigrationInterface, QueryRunner } from 'typeorm';

export class SoilTypeData1731772118902 implements MigrationInterface {
  public async up(queryRunner: QueryRunner): Promise<void> {
    await queryRunner.query(`
        INSERT INTO "soil_type" ("name", "description")
        VALUES 
            ('Чорнозем', 'Родючий ґрунт, багатий органічними речовинами, характерний для степів і лісостепів.'),
            ('Підзолисті ґрунти', 'Бідні на поживні речовини ґрунти, що утворюються в лісових зонах, часто з яскраво вираженою підзолистою горизонтом.'),
            ('Сіроземи', 'Ґрунти з світлим кольором, зустрічаються в сухих та напівсухих кліматах, часто мають вапняний характер.'),
            ('Лісові ґрунти', 'Ґрунти, що утворюються в лісах, багаті на органічні речовини, темного кольору.'),
            ('Гірські ґрунти', 'Ґрунти, характерні для гірських місцевостей, часто важкі, з високим вмістом каменів.'),
            ('Торфові ґрунти', 'Ґрунти, що утворюються в болотистих місцевостях, багаті органічними речовинами, але часто бідні на поживні елементи.'),
            ('Солонці', 'Ґрунти з високим вмістом солей, що утворюються в умовах посушливого клімату.'),
            ('Лугові ґрунти', 'Родючі ґрунти, що утворюються в лугових зонах, багаті на поживні речовини та органічні елементи.');
    `);
  }

  public async down(queryRunner: QueryRunner): Promise<void> {
    await queryRunner.query('DELETE FROM soil_type');
  }
}
